app/views/users/show.html.erb

	  			<% for comment in @user.comments %>
		  				<% if current_user != User.find(Review.find(comment.review_id).user_id)%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "17"]]