app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "created_at", "gmaps", "latitude", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new
      if @location.valid?
      @locations = Location.all
      @latLngs = []
      @paths = []
      @locations.each do |location|
          if location.latitude
            latLng = [location.latitude, location.longitude]
            @latLngs.push(latLng)
          elsif location.path
            @paths.push(location.path)

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "locations" SET "address" = '198 College Hill rd, clinton, ny', "gmaps" = 'f', "latitude" = 43.0512606, "longitude" = -75.40397089999999, "updated_at" = '2014-09-29 20:05:41.967159' WHERE "locations"."id" = 2
---
  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])