app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
---
  def index

    @search = Trail.search do

INSERT INTO "trails" ("created_at", "description", "name", "rating", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 16 Sep 2014 19:30:10 UTC +00:00], ["description", "sdfsdfg"], ["name", "sdfgsd"], ["rating", 1], ["updated_at", Tue, 16 Sep 2014 19:30:10 UTC +00:00]]
---
  def create
  	Trail.create params[:trail]