app/controllers/users_controller.rb

  def index
    if (!signed_in?)
      redirect_to root_path
    end
  	@users = User.all
---
SELECT "users".* FROM "users"

  def create
  	@user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 18 Sep 2014 15:24:55 UTC +00:00], ["email", "zarnold@hamilton.edu"], ["password", "29"], ["updated_at", Thu, 18 Sep 2014 15:24:55 UTC +00:00], ["username", "ZarNold"]]

  def deleteuser
  	curUser = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", :id]]

  def edit
  	@curUser = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "13"]]

  def update
    #render :text => params.inspect
    retUser = params[:user]
    curUser = User.find(params[:id])
    curUser.email = retUser[:email]
    curUser.password = retUser[:password]
    curUser.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "users" SET "email" = NULL, "password" = NULL, "updated_at" = '2014-09-18 22:05:43.831834' WHERE "users"."id" = 13